app/controllers/tarot_results_controller.rb

  def show
    @result_cards = @tarot_result.tarot_result_cards.order(:position)
---
SELECT "tarot_result_cards".* FROM "tarot_result_cards" WHERE "tarot_result_cards"."tarot_result_id" = $1 ORDER BY "tarot_result_cards"."position" ASC  [["tarot_result_id", 27]]

  def draw
    unless @tarot_result.draw_next_card!
      redirect_to @tarot_result, alert: "これ以上カードを引けません"
      return
    end

    text, ok = AiFortuneService.new(@tarot_result).call

    Rails.logger.info("[draw] AiFortuneService ok=#{ok} len=#{text.to_s.length} tarot_result_id=#{@tarot_result.id}")

    @tarot_result.update!(result_text: text) if ok

    redirect_to @tarot_result, notice: "カードを引きました（#{@tarot_result.tarot_result_cards.count}枚目）", status: :see_other
---
UPDATE "tarot_results" SET "result_text" = $1, "updated_at" = $2 WHERE "tarot_results"."id" = $3  [["result_text", "たぬまる先生は、選ばれたテーマに耳を傾けました。\n\nこの3枚のカードは、\n「今・流れ・未来」を表しています。\n\n焦らなくて大丈夫。\n一歩ずつでいいんですよ🦝\n"], ["updated_at", "2026-01-29 09:28:15.301576"], ["id", 29]]
SELECT COUNT(*) FROM "tarot_result_cards" WHERE "tarot_result_cards"."tarot_result_id" = $1  [["tarot_result_id", 30]]

  def set_tarot_result
    @tarot_result = TarotResult.find(params[:id])
---
SELECT "tarot_results".* FROM "tarot_results" WHERE "tarot_results"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]