app/controllers/tarot_results_controller.rb

  def create
    if guest_today?
      build_guest_today
      return render :guest_show
    end

    require_login_for_member_fortunes!
    return unless user_signed_in?

    @tarot_result =
      if user_signed_in?
        build_member_result!
      else
        build_guest_result!
      end

    draw_next_card!(@tarot_result)

    begin
      refresh_result_text!(@tarot_result)
    rescue OpenAI::Errors::RateLimitError
      @tarot_result.update!(result_text: nil) if @tarot_result.result_text.present?
---
UPDATE "tarot_results" SET "result_text" = $1, "updated_at" = $2 WHERE "tarot_results"."id" = $3