app/models/user.rb

  def create_profile!
    build_profile.save!
---
INSERT INTO "profiles" ("user_id", "nickname", "bio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["nickname", nil], ["bio", nil], ["created_at", "2026-01-27 02:54:00.497417"], ["updated_at", "2026-01-27 02:54:00.497417"]]