app/views/tarot_results/show.html.erb

      debug: result_id=<%= @tarot_result.id %> /
      cards=<%= @tarot_result.tarot_result_cards.count %> /
---
SELECT COUNT(*) FROM "tarot_result_cards" WHERE "tarot_result_cards"."tarot_result_id" = $1  [["tarot_result_id", 18]]